package com.wanmi.sbc.goods.bean.enums;

import com.wanmi.sbc.common.enums.ErrorCode;

/**
 * @author zhanggaolei
 * @type GoodsErrorCodeEnum.java
 * @desc
 * @date 2023/2/21 19:50
 */
public enum  GoodsErrorCodeEnum implements ErrorCode {
    //原错误码：K-110301
    K030001("已签约该类目，不能重复签约"),

    //原错误码：K-110302
    K030002("最多可签约200个类目"),

    //原错误码：K-110303
    K030003("经营资质最多上传10张"),

    //原错误码：K-110304
    K030004("所选平台类目不存在"),

    //原错误码：K-110305
    K030005("该类目不存在"),

    //原错误码：K-110306
    K030006("该类目关联了商品，请先删除商品后再"),

    //原错误码：K-110307
    K030007("类目:{0},不存在"),

    //原错误码：K-110308
    K030008("品牌:{0},不存在"),

    //原错误码：K-110401
    K030009("授权文件最多上传2张"),

    //原错误码：K-110403
    K030010("签约信息还在审核中，请勿编辑保存"),

    //原错误码：K-110404
    K030011("签约信息状态有误，请刷新页面重试"),

    //原错误码：K-110405
    K030012("签约数据缺失，请联系商家"),

    //原错误码：K-110406
    K030013("存在待审核的二次签约分类数据，请审"),

    //原错误码：K-110407
    K030014("存在待审核的二次签约品牌数据，请审"),

    //原错误码：K-110408
    K030015("当前类目已关联了商品，暂时不可删除"),

    //原错误码：K-110409
    K030016("该类目关联了商品，请先删除商品后再"),

    //原错误码：K-110501
    K030017("店铺分类名称已存在"),

    //原错误码：K-110505
    K030018("父分类不存在"),

    //原错误码：K-110506
    K030019("默认分类不存在"),

    //原错误码：K-110507
    K030020("店铺分类不存在"),

    //原错误码：K-110508
    K030021("店铺分类已存在"),

    //原错误码：K-110509
    K030022("门店分类名称已存在"),

    //原错误码：K-110601
    K030023("图片父类不存在"),

    //原错误码：K-110602
    K030024("默认分类不存在"),

    //原错误码：K-110603
    K030025("最多支持{0}个子分类"),

    //原错误码：K-110604
    K030026("分类名称已存在"),

    //原错误码：K-110605
    K030027("店铺分类层次最多允许{0}级"),

    //原错误码：K-110701
    K030028("模板名称过长，请修改模板名称或重新选择模版进行复制！"),

    //原错误码：K-110702
    K030029("模板名称重复，请修改模板名称或重新选择模版进行复制！"),

    //原错误码：K-110703
    K030030("地区不可重复设置！"),

    //原错误码：K-110704
    K030031("模板名称重复，请修改模板名称！"),

    //原错误码：K-110705
    K030032("模板不存在，请选择其他模板！"),

    //原错误码：K-110801
    K030033("商品详情模板名称已经存在"),

    //原错误码：K-110802
    K030034("最多可添加3个自定义模板"),

    //原错误码：K-030001
    K030035("商品不存在"),

    //原错误码：K-030002
    K030036("SPU编码不可重复"),

    //原错误码：K-030003
    K030037("SKU编码不可重复"),

    //原错误码：K-030004
    K030038("SKU编码[{0}]重复"),

    //原错误码：K-030005
    K030039("商品不允许修改平台类目"),

    //原错误码：K-030006
    K030040("当前商品不属于当前的供应商"),

    //原错误码：K-030007
    K030041("该商品已下架"),

    //原错误码：K-030008
    K030042("商品设价类型错误"),

    //原错误码：K-030009
    K030043("商品关联商品库已被平台删除"),

    //原错误码：K-030010
    K030044("修改linkedmall商品失败,linkedmall商品sku不存在,linkedmall商品sku编码：{0}"),

    //原错误码：K-030011
    K030045("修改linkedmall商品失败,linkedmall商品库不存在sku,linkedmall商品sku编码：{0}"),

    //原错误码：K-030012
    K030046("商品已全部取消代销，请重新导入"),

    //原错误码：K-030015
    K030047("商品SKU不存在"),

    //原错误码：K-030018
    K030048("虚拟商品不可设置运费模板"),

    //原错误码：K-030022
    K030049("SPU编码不能为空"),

    //原错误码：K-030023
    K030050("SKU编码不能为空"),

    //原错误码：K-030025
    K030051("商品暂时无法上架"),

    //原错误码：K-030101
    K030052("相关父类不存在"),

    //原错误码：K-030102
    K030053("默认分类不存在"),

    //原错误码：K-030103
    K030054("该父类下最多支持100个分类"),

    //原错误码：K-030104
    K030055("分类名称已存在"),

    //原错误码：K-030105
    K030056("您只能添加20个一级分类"),

    //原错误码：K-030106
    K030057("平台类目不存在"),

    //原错误码：K-030201
    K030058("品牌不存在"),

    //原错误码：K-030202
    K030059("最多添加200个品牌"),

    //原错误码：K-030203
    K030060("品牌名称已存在"),

    //原错误码：K-030301
    K030061("商品库存不足"),

    //原错误码：k-030302
    K030062("库存数量:{0}"),

    //原错误码：K-030402
    K030063("仅限xlsx、xls格式文件"),

    //原错误码：K-030403
    K030064("文件大小不能大于{0}M"),

    //原错误码：K-030404
    K030065("{0}"),

    //原错误码：K-030405
    K030066("数据为空，请完善内容"),

    //原错误码：K-030406
    K030067("数据不正确，请使用模板文件填写"),

    //原错误码：K-030407
    K030068("商品ES初始失败，页码位置：{0}"),

    //原错误码：K-030408
    K030069("导入数据有误！"),

    //原错误码：K-030409
    K030070("导入失败，请重试！"),

    //原错误码：K-030410
    K030071("导入数据量超过上限{0}条"),

    //原错误码：K-030411
    K030072("当前客户等级已发生变化，请重新下载模板"),

    //原错误码：K-030412
    K030073("数据不正确，请使用导出的文件填写"),

    //原错误码：K-030413
    K030074("原始数据发生变更，请重新上传文件查看错误模版"),

    //原错误码：K-030504
    K030075("请新增属性值"),

    //原错误码：K-030505
    K030076("只可针对单个SKU进行部分上架"),

    //原错误码：K-030506
    K030077("该供应商商品sku已下架，不可进行操作"),

    //原错误码：K-030507
    K030078("该商品来源数据不存在或已被删除"),

    //原错误码：K-030701
    K030079("存在失效或者批发模式的商品，请删除后再保存"),

    //原错误码：K-030701
    K030080("商品设置参数错误"),

    //原错误码：K-030702
    K030081("存在失效的商品，请删除后再保存"),

    //原错误码：K-030801
    K030082("不可购买积分价格商品"),

    //原错误码：K-030801
    K030083("请勿重复点赞！"),

    //原错误码：K-030901
    K030084("分类名称重复！"),

    //原错误码：K-030902
    K030085("分类最多维护30个！"),

    //原错误码：K-030903
    K030086("已有商品关联该分类，无法删除"),

    //原错误码：K-031001
    K030087("SKU编码错误，{0} 已删除"),

    //原错误码：K-031002
    K030088("{0} 店铺已关店"),

    //原错误码：K-031003
    K030089("{0} 店铺已禁用"),

    //原错误码：K-031004
    K030090("{0}已有活动在{1} - {2},请勿在该时间段"),

    //原错误码：K-031005
    K030091("兑换活动已结束，无法启用！"),

    //原错误码：K-031006
    K030092("兑换开始时间应大于当前时间！"),

    //原错误码：K-031007
    K030093("兑换结束时间应在开始时间之后！"),

    //原错误码：K-031008
    K030094("活动数量为0，无法启用！"),

    //原错误码：K-031009
    K030095("{0} 店铺已删除！"),

    //原错误码：K-031010
    K030096("活动已开始，无法编辑!"),

    //原错误码：K-031011
    K030097("活动已开始，无法删除!"),

    //原错误码：K-031012
    K030098("积分商品分类 {0} 已删除，无法添加积分商品！"),

    //原错误码：K-031013
    K030099("活动不在进行中，无法关闭"),

    //原错误码：K-031101
    K030100("订单状态已发生变更，订单不可评价！"),

    //原错误码：K-031101
    K030101("分类名称重复！"),

    //原错误码：K-031102
    K030102("分类最多维护16个！"),

    //原错误码：K-031103
    K030103("已有商品关联该分类，无法删除"),

    //原错误码：K-031104
    K030104("活动分类已删除"),

    //原错误码：K-031201
    K030105("SKU编码为{0}商品已参加秒杀活动，请勿重复添加"),

    //原错误码：K-031202
    K030106("活动开始前一小时后无法修改"),

    //原错误码：K-031203
    K030107("活动开始前一小时后无法删除"),

    //原错误码：K-031204
    K030108("分类:{0}已删除，请重新添加"),

    //原错误码：K-031205
    K030109("添加失败，开场前1小时禁止添加！"),

    //原错误码：K-031206
    K030110("活动商品不存在"),

    //原错误码：K-031207
    K030111("SKU编码为{0}商品已参加限时购或秒杀活动，请勿重复添加"),

    //原错误码：K-031208
    K030112("部分所选商品已参加时间冲突的{0}活动，请勿重复添加"),

    //原错误码：K-031209
    K030113("选择商品最多不可超过{0}个"),

    //原错误码：K-031301
    K030114("该标签名称已存在！"),

    //原错误码：K-031302
    K030115("商品标签最多支持20个"),

    //原错误码：K-031303
    K030116("商品标签不存在!"),

    //原错误码：K-031401
    K030117("请填写{0}"),

    //原错误码：K-031402
    K030118("{0}仅限{1}"),

    //原错误码：K-032101
    K030119("电子口岸信息已变更,请重新选择"),

    //原错误码：K-032102
    K030120("贸易类型信息已变更,请重新选择"),

    //原错误码：K-032103
    K030121("原产国信息已变更,请重新选择"),

    //原错误码：K-032104
    K030122("计量单位信息已变更,请重新选择"),

    //原错误码：K-032105
    K030123("包装类型信息已变更,请重新选择"),

    //原错误码：K-032106
    K030124("商品销售类型已变更,请重新发布"),

    //原错误码：K-032107
    K030125("存在积分商品,请重新发布"),

    //原错误码：K-032110
    K030126("贸易类型不存在"),

    //原错误码：K-032111
    K030127("所选贸易类型和模板文件不匹配,请重新选择"),

    //原错误码：K-050325
    K030128("该电子卡券已经被其他商品绑定！"),

    //原错误码：K-220001
    K030129("属性名称已存在，请重新输入!"),

    //原错误码：K-220002
    K030130("属性值不可超过100个!"),

    //原错误码：K-220003
    K030131("属性值不可重复!"),

    //原错误码：K-220004
    K030132("请填写属性值!"),

    //原错误码：K-220005
    K030133("属性值输入方式不可以修改!"),

    //原错误码：K-220006
    K030134("该属性不存在!"),

    //原错误码：K-240001
    K030135("所属SPU已被提审，请重新选择"),

    //原错误码：K-240002
    K030136("同一SPU下只能选择一个SKU"),

    //原错误码：K-240003
    K030137("包含失效商品，请重新选择"),

    //原错误码：K-240004
    K030138("包含未映射微信类目的商品，请重新选择"),

    //原错误码：K-240005
    K030139("skuNo为{0}的商品未设置图片，请设置图片"),

    //原错误码：K-240006
    K030140("所属SPU不存在或未提审"),

    //原错误码：K-800001
    K030141("此活动不可添加批发商品！"),

    //原错误码：K-700001
    K030142("预售活动不在进行中，无法关闭!"),

    //原错误码：K-090601
    K030143("图片父类不存在"),

    //原错误码：K-090602
    K030144("默认分类不存在"),

    //原错误码：K-090603
    K030145("该父类下最多支持20个分类"),

    //原错误码：K-090604
    K030146("分类名称已存在"),

    //原错误码：K-030401
    K030147("商品导出模板未配置"),

    //原错误：K-130014
    K030148("待审核商品不可编辑"),

    //原错误：K-130016
    K030149("商品禁售中,不可在编辑未审核商品"),

    //原错误：K-080302
    K030150("拼团分类已到达上限"),

    //原错误：K-080302
    K030151("小店商品已失效"),

    //原错误：K-130017
    K030152("待审核商品不可删除"),

    //原错误：K-080368
    K030153("商品已失效"),

    //原错误：K-170101
    K030154("评价中不能包含敏感词信息"),

    //原错误：K-030601
    K030155("商品库不存在"),

    //原错误：K-030603
    K030156("商品已被导入"),

    //原错误：K-030604
    K030157("商品暂不支持导入"),

    //原错误：K-030602
    K030158("此商品已被商家引用，暂时不可删除！"),

    //原错误：K-110502
    K030159("最多支持{0}个一级分类"),

    //原错误：K-110503
    K030160("店铺分类最多添加{0}个层级"),

    //原错误：K-110504
    K030161("最多支持添加{0}个二级分类"),

    //原错误码：K-120001
    K030162("很抱歉，积分商品已失效！"),

    //原错误码：K-120002
    K030163("很抱歉，积分商品缺货！"),

    //原错误码：K-120003
    K030164("很抱歉，积分商品已过期！"),

    //原错误码：K-120004
    K030165("很抱歉，您的积分余额不足无法兑换！"),

    //原错误码：K-120005
    K030166("很抱歉，积分优惠券缺货"),

    //原错误码：K-120006
    K030167("很抱歉，积分优惠券兑换活动已过期"),

    //原错误码：K-120007
    K030168("很抱歉，积分优惠券兑换活动已停用"),

    //原错误码：K-130013
    K030169("{0}"),

    //原错误码：K-130011
    K030170("{0}"),

    //原错误码：K-130012
    K030171("起订量:{0}"),

    //原错误码：K-130019
    K030172("商品不可售"),

    //原错误码：K-130020
    K030173("代销商品不可修改运费"),

    //原错误码：K-030028
    K030174("仅支持实体商品"),

    //原错误码：K-030026
    K030175("库存低于最低期数，请刷新后重试"),

    //原错误码：K-030123
    K030176("商品已禁售"),

    //原错误码：K-030501
    K030177("非第三级商品类目不能添加属性"),

    //原错误码：K-030502
    K030178("商品类目最多可关联20个属性"),

    //原错误码：K-030503
    K030179("商品类目属性值最多100个"),

    //原错误码：K-030108
    K030180("只可关联三级类目"),

    //原错误码：k-030113
    K030181("包含重复或不存在的类目,请重新选择"),

    //原错误码：k-030110
    K030182("包含已映射的平台类目,请重新选择"),

    //原错误码：k-030111
    K030183("包含已审核通过的类目,请重新选择"),

    //原错误码：k-030112
    K030184("包含待审核的类目,请重新选择"),

    //原错误码：K-031501
    K030185("规格名与商品规格不一致"),

    //原错误码：K-031502
    K030186("已存在同样的规格"),

    //原错误码：k-030109
    K030187("此类目或子类目已关联三方渠道类目，暂时不可删除"),

    //原错误码：K-090801
    K030188("评价系数不能为空"),

    //原错误码：K-090802
    K030189("系数总合不为1"),

    //原错误码：K-098001
    K030190("用户为企业会员，请至企业会员列表内操作"),

    //原错误码：K-030303
    K030191("skuNo为{0}的商品库存不足"),

    //原错误码：K-030003
    K030192("SKU订货号不可重复"),

    //原错误码：K-030004
    K030193("SKU订货号[{0}]重复"),;


    private String msg;
    GoodsErrorCodeEnum(String msg){
        this.msg = msg;
    }


    @Override
    public String getCode() {
        return this.name();
    }

    public String getMsg(){
        return this.msg;
    }
}