package com.wanmi.sbc.empower.bean.enums;

import com.wanmi.sbc.common.enums.ErrorCode;

/**
 * @author zhanggaolei
 * @type EmpowerErrorCodeEnum.java
 * @desc
 * @date 2023/2/21 19:50
 */
public enum  EmpowerErrorCodeEnum implements ErrorCode {
    //原错误码：K-100001
    K060001("支付渠道已关闭"),

    //原错误码：K-100202
    K060002("请求的支付渠道不支持当前终端"),

    //原错误码：K-100203
    K060003("该订单已支付，正在为您更新订单状态"),

    //原错误码：K-100204
    K060004("回调业务类型与请求业务类型不一致"),

    //原错误码：K-100205
    K060005("支付网关不存在"),

    //原错误码：K-100206
    K060006("该订单正在支付处理中"),

    //原错误码：K-100207
    K060007("该订单已创建支付，30秒内请勿重复创建"),

    //原错误码：K-100208
    K060008("支付宝SDK调用异常：{0}"),

    //原错误码：K-100209
    K060009("支付宝退款回调异常"),

    //原错误码：K-100210
    K060010("订单已支付，请勿重复支付"),

    //原错误码：K-100211
    K060011("（支付宝）{0}"),

    //原错误码：K-100212
    K060012("（微信）{0}"),

    //原错误码：K-100213
    K060013("{0}"),

    //原错误码：K-100214
    K060014("（银联）{0}"),

    //原错误码：K-300501
    K060015("友盟:接口配置空"),

    //原错误码：K-300502
    K060016("友盟:网络请求失败"),

    //原错误码：K-300503
    K060017("友盟:网络请求IO异常"),

    //原错误码：K-300504
    K060018("友盟:文件上传失败"),

    //原错误码：K-300505
    K060019("友盟:组装参数异常"),

    //原错误码：K-300506
    K060020("友盟:{0}接口返回失败"),

    //原错误码：K-300507
    K060021("任务已开始，不可操作"),

    //原错误码：K-140101
    K060022("获取京东token失败"),

    //原错误码：K-140102
    K060023("刷新京东token失败"),

    //原错误码：K-140201
    K060024("获取京东供应商失败"),

    //原错误码：K-140202
    K060025("获取京东供应商分类列表失败"),

    //原错误码：K-140203
    K060026("获取京东供应商商品池失败"),

    //原错误码：K-140204
    K060027("获取京东相似商品失败"),

    //原错误码：K-090909
    K060028("企微客服、阿里云客服、网易七鱼客服不可同时开启"),

    //原错误码：K-990001
    K060029("拉卡拉异常：{0}"),

    //原错误码：K-990002
    K060030("分账失败，请稍后重试"),

    //原错误码：K-090702
    K060031("阿里云OSS连接不可用"),

    //原错误码：K-100104
    K060032("该退单已退款，正在为您更新退单状态"),

    //原错误码：K-100105
    K060033("该退单正在退款处理中，请等待处理结果"),
    //原错误码：K-700000
    K060034("第三方商品无效"),

    K060035("平台对应客服未开启"),

    K060044("（拉卡拉收银台）{0}");


    private String msg;
    EmpowerErrorCodeEnum(String msg){
        this.msg = msg;
    }


    @Override
    public String getCode() {
        return this.name();
    }

    public String getMsg(){
        return this.msg;
    }
}