package com.wanmi.sbc.marketing.bean.enums;

import com.wanmi.sbc.common.enums.ErrorCode;

/**
 * @author zhanggaolei
 * @type MarketingErrorCodeEnum.java
 * @desc
 * @date 2023/2/21 19:50
 */
public enum  MarketingErrorCodeEnum implements ErrorCode {
    //原错误码：K-080001
    K080001("营销活动不存在"),

    //原错误码：K-080002
    K080002("当前营销活动无法删除"),

    //原错误码：K-080003
    K080003("当前营销活动无法暂停"),

    //原错误码：K-080004
    K080004(" {0} 款商品活动时间冲突，请删除后再保存"),

    //原错误码：K-080005
    K080005("金额仅限0.01-99999999.99间的数字"),

    //原错误码：K-080006
    K080006("数量仅限1-9999间的整数"),

    //原错误码：K-080007
    K080007("折扣仅限0.1-9.9间的数字"),

    //原错误码：K-080008
    K080008("减免金额须小于条件金额"),

    //原错误码：K-080009
    K080009("最少选择1种赠品"),

    //原错误码：K-080010
    K080010("最多选择20种赠品"),

    //原错误码：K-080011
    K080011("多级促销条件金额不可相同"),

    //原错误码：K-080012
    K080012("多级促销条件件数不可相同"),

    //原错误码：K-080013
    K080013("赠品数量仅限1-999间的整数"),

    //原错误码：K-080014
    K080014("当前营销活动无法开始"),

    //原错误码：K-080015
    K080015("当前营销活动已开始或已结束，无法编辑"),

    //原错误码：K-080016
    K080016("您没有权限查看当前的营销活动"),

    //原错误码：K-080017
    K080017("营销活动已暂停"),

    //原错误码：K-080018
    K080018("营销活动已过期"),

    //原错误码：K-080019
    K080019("商品已存在于其它进行中拼团活动"),

    //原错误码：K-080020
    K080020("选择的拼团商品已被下架或禁售"),

    //原错误码：K-080021
    K080021("选择的拼团活动分类已被删除"),

    //原错误码：K-080022
    K080022("营销活动时间或规则冲突，请重新设置"),

    //原错误码：K-080023
    K080023("请选择商品"),

    //原错误码：K-080024
    K080024("同一商品同门店同一时间段仅可参与一个营销活动"),

    //原错误码：K-080029
    K080025("无效卡密"),

    //原错误码：K-080030
    K080026("部分所选商品已参加时间冲突的{0}活动，请勿重复添加"),

    //原错误码：K-080031
    K080027("选择商品最多不可超过{0}个"),

    //原错误码：K-080032
    K080028("加价购商品金额不可小于等于0"),

    //原错误码：K-080033
    K080029("金额仅限1-99999间的数字"),

    //原错误码：K-080034
    K080030("最少选择1种换购商品"),

    //原错误码：K-080035
    K080031("最多选择20种换购商品"),

    //原错误码：K-080036
    K080032("换购商品不可重复"),

    //原错误码：K-080038
    K080033("礼品卡已过期"),

    //原错误码：K-080039
    K080034("礼品卡库存不足"),

    //原错误码：K-080040
    K080035("礼品卡批次不存在"),

    //原错误码：K-080041
    K080036("礼品卡批次已被审核"),

    //原错误码：K-080042
    K080037("礼品卡已过期，自动审核失败"),

    //原错误码：K-080043
    K080038("发卡失败的礼品卡，不允许销卡"),

    //原错误码：K-080044
    K080039("礼品卡不存在"),

    //原错误码：K-080045
    K080040("礼品卡激活失败"),

    //原错误码：K-080046
    K080041("礼品卡余额发生变化，请重新选择"),

    //原错误码：K-080047
    K080042("已销卡，请刷新后查看"),

    //原错误码：K-080048
    K080043("销卡失败，请刷新页面后重试"),

    //原错误码：K-080101
    K080044("优惠券分类名称已存在"),

    //原错误码：K-080103
    K080045("优惠券分类不存在"),

    //原错误码：K-080104
    K080046("优惠券不存在"),

    //原错误码：K-080105
    K080047("优惠券已经关联活动"),

    //原错误码：K-080106
    K080048("选择的 {0} 优惠券失效时间必须大于活动结束时间"),

    //原错误码：K-080107
    K080049("活动正在进行中"),

    //原错误码：K-080108
    K080050("活动未开始"),

    //原错误码：K-080109
    K080051("活动已结束"),

    //原错误码：K-080110
    K080052("领券失败~"),

    //原错误码：K-080111
    K080053("活动和优惠券的规则关联不存在"),

    //原错误码：K-080112
    K080054("啊哦，活动失效咯~"),

    //原错误码：K-080113
    K080055("可选活动日期发生了变化，请重新选择"),

    //原错误码：K-080114
    K080056("优惠券已经关联会员权益"),

    //原错误码：K-080115
    K080057("活动已暂停"),

    //原错误码：K-080116
    K080058("该活动不支持关闭"),

    //原错误码：K-080118
    K080059("活动冲突，请重新选择活动日期"),

    //原错误码：K-080119
    K080060("仅限新人可领取哦～"),

    //原错误码：K-080120
    K080061("活动已经开始"),

    //原错误码：K-080120
    K080062("券组数量不足"),

    //原错误码：K-080121
    K080063("活动已经结束"),

    //原错误码：K-080122
    K080064("用户不存在"),

    //原错误码：K-080124
    K080065("活动奖品配置数量异常"),

    //原错误码：K-080125
    K080066("活动时间配置异常"),

    //原错误码：K-080126
    K080067("奖品概率不能超过100"),

    //原错误码：K-080127
    K080068("活动抽奖次数在1-999之间"),

    //原错误码：K-080128
    K080069("活动富文本内容长度不能超过1000字符"),

    //原错误码：K-080129
    K080070("抽奖活动不存在"),

    //原错误码：K-080130
    K080071("抽奖活动未开始"),

    //原错误码：K-080131
    K080072("抽奖活动不能暂停"),

    //原错误码：K-080132
    K080073("抽奖活动不能开始"),

    //原错误码：K-080133
    K080074("活动已经暂停"),

    //原错误码：K-080134
    K080075("抽奖活动奖品不存在"),

    //原错误码：K-080135
    K080076("奖品已兑奖"),

    //原错误码：K-080136
    K080077("奖品未兑奖"),

    //原错误码：K-080137
    K080078("抽奖记录不存在"),

    //原错误码：K-080138
    K080079("奖品已发货"),

    //原错误码：K-080139
    K080080("此次抽奖未中奖"),

    //原错误码：K-080140
    K080081("活动正在进行中"),

    //原错误码：K-080141
    K080082("优惠券 {0} 过期时间早于活动结束时间"),

    //原错误码：K-080142
    K080083("您没有抽奖权限"),

    //原错误码：K-080143
    K080084("您当前积分不足"),

    //原错误码：K-080201
    K080085("商品异常，请重试"),

    //原错误码：K-080202
    K080086("会员异常，请重试"),

    //原错误码：K-080203
    K080087("会员领券失败，不符合领券要求"),

    //原错误码：K-080204
    K080088("啊哦，优惠券抢光了~"),

    //原错误码：K-080205
    K080089("您已经领过了哦~"),

    //原错误码：K-080206
    K080090("订单中存在不符合使用条件的优惠券"),

    //原错误码：K-080207
    K080091("您已到达领取上限咯~"),

    //原错误码：K-080208
    K080092("优惠券 {0} 已删除！"),

    //原错误码：K-080209
    K080093("优惠券 {0} 截止时间小于兑换结束时间"),

    //原错误码：K-080210
    K080094("兑换结束时间应在开始时间之后！"),

    //原错误码：K-080211
    K080095("优惠券 {0} 已有兑换时间在{1} - {2},请勿在该时间段"),

    //原错误码：K-080212
    K080096("兑换开始时间应大于当前时间！"),

    //原错误码：K-080213
    K080097("兑换活动已结束，无法启用!"),

    //原错误码：K-080214
    K080098("库存为0，无法启用!"),

    //原错误码：K-080215
    K080099("活动已开始，无法编辑!"),

    //原错误码：K-080216
    K080100("活动已开始，无法删除!"),

    //原错误码：K-080217
    K080101("兑换活动不存在！"),

    //原错误码：K-080218
    K080102("兑换活动不在进行中，无法关闭!"),

    //原错误码：K-080369
    K080103("拼团活动不在进行中，无法关闭"),

    //原错误码：K-081001
    K080104("活动商品最少添加2个sku商品"),

    //原错误码：K-081002
    K080105("活动商品最多添加20个sku商品"),

    //原错误码：K-081003
    K080106("折扣价不可大于单价"),

    //原错误码：K-081004
    K080107("商品 {0} 不存在，请重新选择！"),

    //原错误码：K-081005
    K080108("发券时间不能早于当前时间！"),

    //原错误码：K-081006
    K080109("当前组合购活动已存在，请修改活动时间或活动商品"),

    //原错误码：K-081007
    K080110("存在无效商品请确认！"),

    //原错误码：K-083001
    K080111("卡券模版未设置"),

    //原错误码：K-083005
    K080112("已发放的不能删除，请检查后重新选择"),

    //原错误码：K-083006
    K080113("卡密信息至少填一项"),

    //原错误码：K-083007
    K080114("该卡密已无法修改"),

    //原错误码：K-083008
    K080115("卡号已存在"),

    //原错误码：K-083009
    K080116("卡密已存在"),

    //原错误码：K-083010
    K080117("优惠码已存在"),

    //原错误码：K-083011
    K080118("已发放的无法重发，请检查后重新选择"),

    //原错误码：K-083012
    K080119("该卡券名称已被使用，请重新操作"),

    //原错误码：K-160001
    K080120("抢购失败"),

    //原错误码：K-160002
    K080121("没有预约,不可抢购"),

    //原错误码：K-160003
    K080122("无抢购资格"),

    //原错误码：K-160004
    K080123("此商品活动范围只限于店铺内会员"),

    //原错误码：K-160005
    K080124("活动已过期"),

    //原错误码：K-170001
    K080125("已经预约"),

    //原错误码：K-170002
    K080126("预约失败"),

    //原错误码：K-170003
    K080127("活动不存在"),

    //原错误码：K-170004
    K080128("活动已取消"),

    //原错误码：K-170005
    K080129("活动未开始"),

    //原错误码：K-170006
    K080130("活动已结束"),

    //原错误码：K-170007
    K080131("此商品不参与此预约活动"),

    //原错误码：K-170008
    K080132("此商品活动范围只限于店铺内会员"),

    //原错误码：K-170009
    K080133("您没有权限参与此预约活动"),

    //原错误码：K-180001
    K080134("很抱歉，您还没有获取资格购买预约商品！"),

    //原错误码：K-190001
    K080135("类目渠道为空"),

    //原错误码：K-600001
    K080136("开始时间不可早于当前时间"),

    //原错误码：K-600002
    K080137("结束时间不可早于等于开始时间"),

    //原错误码：K-600003
    K080138("抢购时间的开始时间不可早于预约时间的结束时间"),

    //原错误码：K-600004
    K080139("发货时间不可早于抢购开始时间"),

    //原错误码：K-600005
    K080140("{0} 款商品活动时间冲突，请删除后再保存"),

    //原错误码：K-600006
    K080141("批发商品不能参与此活动"),

    //原错误码：K-600007
    K080142("活动正在进行中,不可修改"),

    //原错误码：K-600008
    K080143("活动名称已存在"),

    //原错误码：K-600011
    K080144("尾款支付的开始时间不可早于定金支付的结束时间"),

    //原错误码：K-600012
    K080145("发货时间不可早于尾款支付开始时间"),

    //原错误码：K-600013
    K080146("定金膨胀金额必须大于定金"),

    //原错误码：K-600014
    K080147("定金不能为空"),

    //原错误码：K-600015
    K080148("预售价不能为空"),

    //原错误码：K-600016
    K080149("发货时间不可早于预售开始时间"),

    //原错误码：K-600020
    K080150("预约活动不在进行中，无法关闭!"),

    //原错误码：K-000323
    K080151("SKU编码为{0}，已存在于其他进行中砍价活动，请检查后再次添加"),

    //原错误码：K-000324
    K080152("该砍价商品{0}，无法删除！"),

    //原错误码：K-000325
    K080153("该砍价商品{0}，无法终止！"),

    //原错误码：K-000326
    K080154("{0}平均每人帮砍金额需大于0.01"),

    //原错误码：K-000327
    K080155("该砍价商品{0}，无法编辑！"),

    //原错误码：K-000328
    K080156("部分商品信息已变更，所选商品中{0}，请删除后重新选择"),

    //原错误码：K-000329
    K080157("砍价商品活动状态已变更，请刷新页面后重新选择"),

    //原错误码：K-051001
    K080158("砍价活动已停止"),

    //原错误码：K-051002
    K080159("您已参加过此砍价活动"),

    //原错误码：K-051003
    K080160("您无法给自己砍价"),

    //原错误码：K-051004
    K080161("今日帮砍次数已达上限"),

    //原错误码：K-051005
    K080162("抱歉！您已经帮好友助力过了！"),

    //原错误码：K-051006
    K080163("此商品已完成砍价"),

    //原错误码：K-051007
    K080164("此商品已下单"),

    //原错误码：K-051008
    K080165("活动库存不足"),

    //原错误码：K-051009
    K080166("砍价商品只能购买一次"),

    //原错误码：K-051010
    K080167("已砍人数达到上限"),

    //原错误码：K-051258
    K080168("请先至分账绑定内和此商家绑定分账关系"),

    //原错误码：K-093010
    K080169("视频号内不支持0元商品，请联系商家"),

    //原错误码：K-600017
    K080170("很抱歉，您的订单中包含预约中的商品！"),

    //原错误码：K-600018
    K080171("很抱歉，您的订单中包含预售中的商品！"),

    //原错误码：K-140001
    K080172("您抢购该商品对应秒杀活动还未开始！"),

    //原错误码：K-140002
    K080173("您抢购该商品的数量已经超过抢购上限！"),

    //原错误码：K-140003
    K080174("您抢购该商品的数量小于最小起购数！"),

    //原错误码：K-140004
    K080175("您抢购该商品的库存不足！"),

    //原错误码：K-140005
    K080176("您抢购该商品的秒杀活动不存在！"),

    //原错误码：K-140006
    K080177("您抢购该商品的秒杀活动已结束！"),

    //原错误码：K-140007
    K080178("抢购失败！"),

    //原错误码：K-140011
    K080179("商品已被抢完，看看其他商品吧!"),

    //原错误码：K-080301
    K080180("拼团分类已存在"),

    //原错误码：K-080301
    K080181("小店已失效"),

    //原错误码：K-170010
    K080182("未到尾款支付时间"),

    //原错误码：K-080303
    K080183("拼团分类不存在"),

    //原错误码：K-200401
    K080184("已被运营计划引用，不可删除"),

    //原错误码：K-200402
    K080185("人群计划名称已存在"),

    //原错误码：K-200403
    K080186("已选目标人群发送变更，请重新选择"),

    //原错误码：K-080025
    K080187("预热时间不可大于168小时"),

    //原错误码：K-080026
    K080188("开始时间不可早于当前时间"),

    //原错误码：K-080027
    K080189("开始结束时间不可相同"),

    //原错误码：K-080117
    K080190("啊哦~领券活动已失效，下次一定要早点来哦~"),

    //原错误码：K-080102
    K080191("优惠券分类已经到达上限"),

    //原错误码：K-080123
    K080192("已达到抽奖次数上限"),

    //原错误码：K-080028
    K080193("卡券和虚拟商品不可与实物商品混选"),

    //原错误码：K-080367
    K080194("拼团活动过期或拼团商品不存在"),

    //原错误码：K-120011
    K080195("{0}，提现申请已取消，无法进行审核/驳回操作"),

    //原错误码：K-090102
    K080196("{0}，提现申请已取消，无法进行审核/驳回操作"),

    //原错误码：K-083002
    K080197("仅限xlsx、xls格式文件"),

    //原错误码：K-083003
    K080198("数据不正确，请使用模板文件填写"),

    //原错误码：K-083004
    K080199("数据为空，请完善内容"),

    K080200("提现申请已取消，请勿重复操作"),

    K080201("提现已完成，请勿重复操作"),
    K080202("提货卡已被使用"),
    K080203("活动库存不足"),

    K080300("该提货卡为以旧送新活动赠送,需校服小助手订单过售后才能激活");


    private String msg;
    MarketingErrorCodeEnum(String msg){
        this.msg = msg;
    }


    @Override
    public String getCode() {
        return this.name();
    }

    public String getMsg(){
        return this.msg;
    }
}