package com.wanmi.sbc.common.enums;

/**
 * @author zhanggaolei
 * @type CommonErrorCodeEnum.java
 * @desc
 * @date 2023/2/21 19:50
 */
public enum  CommonErrorCodeEnum implements ErrorCode{
    //原错误码：K-000000
    K000000("操作成功"),

    //原错误码：K-000001
    K000001("操作失败"),

    //原错误码：K-000002
    K000002("登录失败"),

    //原错误码：K-000003
    K000003("资源不存在"),

    //原错误码：K-000004
    K000004("HTTP异常"),

    //原错误码：K-000005
    K000005("账号已被锁定或禁用"),

    //原错误码：K-000006
    K000006("密码错误次数超限，账号已锁定！"),

    //原错误码：K-000007
    K000007("订单设置为空"),

    //原错误码：K-000008
    K000008("商品不存在或已下架"),

    //原错误码：K-000009
    K000009("参数不正确"),

    //原错误码：K-000010
    K000010("手机验证码不正确"),

    //原错误码：K-000011
    K000011("上传文件失败"),

    //原错误码：K-000012
    K000012("发送短信失败，请重试！"),

    //原错误码：K-000013
    K000013("手机账号不正确"),

    //原错误码：K-000014
    K000014("此功能您没有权限访问，请联系管理员修改权"),

    //原错误码：K-000015
    K000015("获取授权失败"),

    //原错误码：K-000016
    K000016("操作频繁，请稍后重试！"),

    //原错误码：K-000017
    K000017("输入内容包含非法字符"),

    //原错误码：K-000018
    K000018("暂无权限访问"),

    //原错误码：K-000019
    K000019("功能不可用"),

    //原错误码：K-000020
    K000020("接口授权错误，接口请求需要登录"),

    //原错误码：K-000021
    K000021("无法调用远程服务"),

    //原错误码：K-000022
    K000022("验证码失效"),

    //原错误码：K-000029
    K000023("生成的错误文件丢失"),

    //原错误码：K-030406
    K000024("导入的文件数据异常，请使用模板文件填写"),

    K000025("密码强度过低，请重新设置"),

    K000026("二维码已失效。请刷新页面重试"),

    K000027("一户一码手机号已被注册请重试"),

    K000040("您添加孩子的数量超出上限"),

    K000060("调用h5接口响应超时"),

    //原错误码：K-999996
    K999996("包含敏感词错误码"),

    //原错误码：K-999997
    K999997("重复提交"),

    //原错误码：K-999998
    K999998("您没有该权限，如需修改请联系管理员!"),

    //原错误码：K-999999
    //指定异常，不走国际化，异常信息由B2bRuntimeException字段result设定
    K999999("{0}"),;


    private String msg;
    CommonErrorCodeEnum(String msg){
        this.msg = msg;
    }


    @Override
    public String getCode() {
        return this.name();
    }

    public String getMsg(){
        return this.msg;
    }
}