package com.wanmi.sbc.message.bean.enums;

import com.wanmi.sbc.common.enums.ErrorCode;

/**
 * @author zhanggaolei
 * @type MessageErrorCodeEnum.java
 * @desc
 * @date 2023/2/21 19:50
 */
public enum  MessageErrorCodeEnum implements ErrorCode {
    //原错误码：K-300101
    K090001("没有启动短信平台"),

    //原错误码：K-300102
    K090002("没有对应平台厂商的实现方法"),

    //原错误码：K-300201
    K090003("没有审核通过的短信签名或者短信签名已删除"),

    //原错误码：K-300202
    K090004("短信签名名称已存在"),

    //原错误码：K-300203
    K090005("短信签名{0}"),

    //原错误码：K-300204
    K090006("该签名已被发送任务或者验证码、通知模板引用，不可编辑或删除。"),

    //原错误码：K-300205
    K090007("请选择有效的短信签名"),

    //原错误码：K-300301
    K090008("没有审核通过的短信模板或者短信模板已删除"),

    //原错误码：K-300302
    K090009("短信模板名称已存在"),

    //原错误码：K-300303
    K090010("短信模板{0}"),

    //原错误码：K-300304
    K090011("验证码用途已被使用"),

    //原错误码：K-300305
    K090012("短信模板不存在"),

    //原错误码：K-300401
    K090013("发送时间不合法，请在选择规定时间（8-22时）"),

    //原错误码：K-300402
    K090014("发送任务不可修改"),

    //原错误码：K-300403
    K090015("发送任务删除失败，任务不存在或已被删除"),

    //原错误码：K-300404
    K090016("发送时间不合法，不能早于当前时间"),

    //原错误码：K-MES001
    K090017("发送时间不可早于当前时间"),

    //原错误码：K-MES002
    K090018("该任务已结束，不可被修改"),

    //原错误码：K-MES003
    K090019("发送时间{0}"),

    //原错误码：K-MES004
    K090020("修改失败{0}"),

    //原错误码：K-MES005
    K090021("状态已发生变化，{0}请刷新页面后查看"),

    //原错误码：K-120001
    K090022("该报表已被删除");


    private String msg;
    MessageErrorCodeEnum(String msg){
        this.msg = msg;
    }


    @Override
    public String getCode() {
        return this.name();
    }

    public String getMsg(){
        return this.msg;
    }
}