package com.wanmi.sbc.account.bean.enums;

import com.wanmi.sbc.common.enums.ErrorCode;

/**
 * @author zhanggaolei
 * @type AccountErrorCodeEnum.java
 * @desc
 * @date 2023/2/21 19:50
 */
public enum  AccountErrorCodeEnum implements ErrorCode {
    //原错误码：K-020001
    K020001("修改线下账户失败"),

    //原错误码：K-020002
    K020002("修改支付单失败"),

    //原错误码：K-020003
    K020003("该项目已存在"),

    //原错误码：K-020004
    K020004("该项目不存在"),

    //原错误码：K-020005
    K020005("线下账户不存在"),

    //原错误码：K-020006
    K020006("该订单已索取过发票"),

    //原错误码：K-020011
    K020007("支持的开票类型不存在"),

    //原错误码：K-020012
    K020008("不支持开票"),

    //原错误码：K-020013
    K020009("一个会员最多可保存5个银行账号"),

    //原错误码：K-020201
    K020010("结算单不存在"),

    //原错误码：K-070006
    K020011("银行账户{0}已存在"),

    //原错误码：K-070007
    K020012("账户不能超过50条"),

    //原错误码：K-082001
    K020013("授信账户不存在"),

    //原错误码：K-082002
    K020014("授信账户状态错误"),

    //原错误码：K-082003
    K020015("存在未还款订单"),

    //原错误码：K-082004
    K020016("当前暂无待还金额"),

    //原错误码：K-082005
    K020017("您有一笔还款中的还款单，请完成后再进行新的还款申请"),

    //原错误码：K-082006
    K020018("当前还款状态不为待审核"),

    //原错误码：K-091011
    K020019("账户可提现金额不足"),

    //原错误码：K-091012
    K020020("提现金额超出当天最大提现金额"),

    //原错误码：K-070003
    K020021("订单已经开过票"),

    //原错误码：K-070004
    K020022("订单发票不存在"),

    //原错误码：K-010206
    K020023("未设置支付密码，请先设置支付密码"),

    //原错误码：K-081011
    K020024("支付方式当前不可用"),

    //原错误码：K-081010
    K020025("授信账户不存在"),

    //原错误码：K-081012
    K020026("额度不足，请确认剩余额度"),

    //原错误码：K-050408
    K020027("可用余额不足，无法支付！"),

    //原错误码：K-050223
    K020028("付费记录状态已变，请刷新"),

    //原错误码：K-081013
    K020029("部分订单已还款，请重新选择关联订单"),

    //原错误码：K-081014
    K020030("部分订单退货/退款中，请重新选择关联订单"),

    //原错误码：K-081016
    K020031("部分订单当前时间不支持还款，请重新选择关联订单"),

    //原错误码：K-070001
    K020032("支付单不存在"),

    //原错误码：K-070005
    K020033("该支付单已经添加过流水"),

    //原错误码：K-070009
    K020034("该收款账号已被删除，请重新添加收款账号"),

    //原错误码：K-020005
    K020035("线下账户账户已被禁用"),;


    private String msg;
    AccountErrorCodeEnum(String msg){
        this.msg = msg;
    }


    @Override
    public String getCode() {
        return this.name();
    }

    public String getMsg(){
        return this.msg;
    }
}