package com.wanmi.sbc.customer.bean.enums;

import com.wanmi.sbc.common.enums.ErrorCode;

/**
 * @author zhanggaolei
 * @type CustomerErrorCodeEnum.java
 * @desc
 * @date 2023/2/21 19:50
 */
public enum  CustomerErrorCodeEnum implements ErrorCode {
    //原错误码：K-010001
    K010001("会员不存在"),

    //原错误码：K-010001
    K010002("用户名或密码错误！"),

    //原错误码：K-010002
    K010003("该账号已存在"),

    //原错误码：K-010002
    K010004("您的账号已被禁用{0}"),

    //原错误码：K-010003
    K010005("该账号已被禁用"),

    //原错误码：K-010004
    K010006("会员账户信息不存在"),

    //原错误码：K-010004
    K010007("连续输错密码5次，请{0}分钟后重试！"),

    //原错误码：K-010005
    K010008("该手机账号不存在，请重新输入！"),

    //原错误码：K-010005
    K010009("一个会员最多可保存5个银行账号"),

    //原错误码：K-010006
    K010010("该手机账号已被禁用！"),

    //原错误码：K-010006
    K010011("会员等级不存在"),

    //原错误码：K-010007
    K010012("默认等级不能编辑"),

    //原错误码：K-010008
    K010013("默认等级不能删除"),

    //原错误码：K-010012
    K010014("会员增专票信息不存在"),

    //原错误码：K-010013
    K010015("会员增专票未通过审核"),

    //原错误码：K-010014
    K010016("客户已被删除,不能下单"),

    //原错误码：K-010014
    K010017("您的账号已被删除"),

    //原错误码：K-010015
    K010018("客户已被禁用,不能下单"),

    //原错误码：K-010016
    K010019("客户不存在"),

    //原错误码：K-010101
    K010020("客户状态异常"),

    //原错误码：K-010101
    K010021("您的手机号已被注册！"),

    //原错误码：K-010102
    K010022("注册失败，请重试！"),

    //原错误码：K-010103
    K010023("提交失败，请重试！"),

    //原错误码：K-010104
    K010024("图片验证码错误"),

    //原错误码：K-010105
    K010025("请填写邀请码!"),

    //原错误码：K-010106
    K010026("请填写正确的邀请码!"),

    //原错误码：K-010107
    K010027("会员不存在"),

    //原错误码：K-010108
    K010028("会员所在公司不存在"),

    //原错误码：K-010201
    K010029("商家客户下不存在该客户"),

    //原错误码：K-010202
    K010030("该客户已经存在于商家"),

    //原错误码：K-010203
    K010031("重置账号已经存在，无法重置"),

    //原错误码：K-010207
    K010032("连续输错密码3次，请{0}分钟后重试！"),

    //原错误码：K-010210
    K010033("分销员等级数量已超过5个，请刷新页面"),

    //原错误码：K-010211
    K010034("高等级升级规则必须大于低等级升级规则，请调整升级规则或刷新页面"),

    //原错误码：K-010212
    K010035("存在佣金比例+佣金提成比例相加大于100%的情况，请调整佣金返利"),

    //原错误码：K-010213
    K010036("必须勾选一个升级规则"),

    //原错误码：K-010214
    K010037("该账号已经注销"),

    //原错误码：K-010214
    K010038("手机号已存在，无法绑定"),

    //原错误码：K-010215
    K010039("手机号不正确，请重新输入！"),

    //原错误码：K-010216
    K010040("暂时无法登录"),

    //原错误码：K-010217
    K010041("不可登录，可重新注册"),

    //原错误码：K-010301
    K010042("后台异常"),

    //原错误码：K-010301
    K010043("已有客户获取了成长值"),

    //原错误码：K-010302
    K010044("后台异常"),

    //原错误码：K-010303
    K010045("为了您的账号安全，30天内不可解除绑定账号"),

    //原错误码：K-010304
    K010046("已绑定"),

    //原错误码：K-010305
    K010047("绑定超时，请重新进行绑定操作"),

    //原错误码：K-010306
    K010048("手机号已绑定微信"),

    //原错误码：K-010307
    K010049("微信已被其他账号绑定，请解绑后再进行绑定"),

    //原错误码：K-010308
    K010050("网络不给力，请重试"),

    //原错误码：K-010312
    K010051("您的账号未绑定微信，请至账户中心-关联账号"),

    //原错误码：K-011001
    K010052("当前账户状态暂不支持修改"),

    //原错误码：K-011002
    K010053("请通知平台开通拉卡拉支付并注册清分账户后再进行操作"),

    //原错误码：K-011003
    K010054("账户不存在"),

    //原错误码：K-011004
    K010055("拉卡拉分账暂不可用，请重新登录后再试"),

    //原错误码：K-011005
    K010056("使用分销员功能之前必须绑定银行卡并进行实名认证"),

    //原错误码：K-011006
    K010057("您的实名认证信息正在审核中暂时无法使用分销功能"),

    //原错误码：K-011007
    K010058("商户或接收方当前状态无法建立绑定关系"),

    //原错误码：K-011008
    K010059("当前商户和接收方已建立绑定关系"),

    //原错误码：K-011009
    K010060("绑定数量已达上限"),

    //原错误码：K-011010
    K010061("您的实名认证审核失败，请修改信息后重新提交"),

    //原错误码：K-011011
    K010062("特约商户支付服务合作协议处理中，请稍后重试"),

    //原错误码：K-011012
    K010063("请先完成注册清分账户操作"),

    //原错误码：K-011013
    K010064("结算授权委托协议不存在，请稍后重试"),

    //原错误码：K-011014
    K010065("分账绑定已审核处理过，无法再次操作"),

    //原错误码：K-011015
    K010066("当前商户暂不支持申请分账绑定，请稍后重试"),

    //原错误码：K-011016
    K010067("当前账户暂不支持申请分账绑定，请稍后重试"),

    //原错误码：K-011017
    K010068("当前账户的分账绑定正在处理中"),

    //原错误码：K-011018
    K010069("分账绑定正在处理中"),

    //原错误码：K-011019
    K010070("分账绑定关系不存在"),

    //原错误码：K-011020
    K010071("仅限pdf格式文件"),

    //原错误码：K-011021
    K010072("请上传分账关系绑定协议"),

    //原错误码：K-011022
    K010073("文件名称不可超过20字符"),

    //原错误码：K-040003
    K010074("该角色已存在"),

    //原错误码：K-040004
    K010075("账号已存在"),

    //原错误码：K-040005
    K010076("手机号码已注册"),

    //原错误码：K-040007
    K010077("员工已被锁定"),

    //原错误码：K-040008
    K010078("用户名或密码错误，您还有{0}次机会"),

    //原错误码：K-040009
    K010079("连续输错密码5次，请{0}分钟后重试！"),

    //原错误码：K-040011
    K010080("手机号码不符合要求"),

    //原错误码：K-040013
    K010081("员工姓名已存在"),

    //原错误码：K-040014
    K010082("此账号不允许操作"),

    //原错误码：K-040015
    K010083("最多只能新增20个员工角色"),

    //原错误码：K-040016
    K010084("角色名称不能为系统管理员"),

    //原错误码：K-040017
    K010085("银行账号已存在"),

    //原错误码：K-040018
    K010086("该账号不存在"),

    //原错误码：K-040019
    K010087("该账号已被禁用{0}"),

    //原错误码：K-040020
    K010088("操作频繁，请稍后重试！"),

    //原错误码：K-040021
    K010089("账号已禁用"),

    //原错误码：K-040022
    K010090("没有需要改变的员工"),

    //原错误码：K-040023
    K010091("暂无权限访问"),

    //原错误码：K-040024
    K010092("请{0}分钟后重试！"),

    //原错误码：K-040025
    K010093("手机号不存在"),

    //原错误码：K-040026
    K010094("该手机账号不存在，请重新输入！"),

    //原错误码：K-040027
    K010095("员工手机为{0}的账户已激活，请重新选择！"),

    //原错误码：K-040028
    K010096("员工手机为{0}已离职，请重新选择！"),

    //原错误码：K-040029
    K010097("员工导入模版未配置"),

    //原错误码：K-040030
    K010098("工号已被占用"),

    //原错误码：K-040031
    K010099("用户未绑定角色"),

    //原错误码：K-040032
    K010100("已绑定用户不可删除"),

    //原错误码：K-040033
    K010101("账号已在其他商家存在"),

    //原错误码：K-110101
    K010102("公司信息不存在"),

    //原错误码：K-110102
    K010103("商家名称已存在"),

    //原错误码：K-110104
    K010104("统一社会信用代码重复"),

    //原错误码：K-110201
    K010105("店铺信息不存在"),

    //原错误码：K-110202
    K010106("店铺名称已存在"),

    //原错误码：K-110203
    K010107("店铺审核未通过"),

    //原错误码：K-110205
    K010108("店铺已审核完毕"),

    //原错误码：K-110206
    K010109("店铺已关店"),

    //原错误码：K-110207
    K010110("店铺已过期"),

    //原错误码：K-110208
    K010111("店铺校验不通过"),

    //原错误码：K-110208
    K010112("店铺收藏最多支持{0}家"),

    //原错误码：K-110209
    K010113("门店编码已存在"),

    //原错误码：K-110210
    K010114("请完善门店必填信息"),

    //原错误码：K-110211
    K010115("当前门店为默认门店，暂不支持关店"),

    //原错误码：K-110212
    K010116("当前门店为已关店状态，不支持设为默认门店"),

    //原错误码：K-110213
    K010117("签约结束时间不可早于当前时间"),

    //原错误码：K-110219
    K010118("当前商户未进件，暂不支持开店"),

    //原错误码：K-110901
    K010119("退货地址最多不能超过20条"),

    //原错误码：K-400101
    K010120("部门父类不存在"),

    //原错误码：K-400102
    K010121("同一级别的部门名称不允许重复"),

    //原错误码：K-400103
    K010122("部门不存在"),

    //原错误码：K-400104
    K010123("数据不正确，请使用模板文件填写"),

    //原错误码：K-400105
    K010124("模板不存在"),

    //原错误码：K-400106
    K010125("该部门下存在员工、不可删除"),

    //原错误码：k-400107
    K010126("部门层级已达上限！"),

    //原错误码：K-500001
    K010127("身份证信息已存在"),

    //原错误码：K-600111
    K010128("当前门店平台尚未配置同城配送相关参数，请联系平台人员确认后再操作"),

    //原错误码：K-097001
    K010129("付费会员等级已存在，有且只有一个等级"),

    //原错误码：K-097112
    K010130("该付费会员不存在"),

    //原错误码：K-097002
    K010131("付费会员等级状态已暂停，请联系客服"),

    //原错误码：K-097192
    K010132("付费会员套餐已变更，请刷新后重新下单"),

    //原错误码：K-040001
    K010133("业务员不存在"),

    //原错误码：K-040012
    K010134("修改员工手机号码需要通过验证码"),

    //原错误码：K-040018
    K010135("该账号不存在"),

    //原错误码：K-040039
    K010136("该供应商账号已存在！"),

    //原错误码：K-040038
    K010137("该商家账号已存在！"),

    //原错误码：K-010205
    K010138("账户已冻结，请稍后再试"),

    //原错误码：K-010204
    K010139("输入密码错误，请重新输入"),

    //原错误码：K-040042
    K010140("交接员工不存在"),

    //原错误码：K-040041
    K010141("交接员工不是业务员"),

    //原错误码：K-040101
    K010142("邮箱数量已达到上限"),

    //原错误码：K-040102
    K010143("该邮箱地址已存在"),

    //原错误码：K-040103
    K010144("该邮箱地址不存在"),

    //原错误码：K-010208
    K010145("会员积分不足"),

    //原错误码：K-010209
    K010146("分销员等级已关联了分销员"),

    //原错误码：K-080401
    K010147("配置付费会员配置好后才能开启，请前往客户-付费会员-付费会员等级创建会员等级"),

    //原错误码：K-080501
    K010148("该增票资质暂不支持删除操作"),

    //原错误码：K-080502
    K010149("该增票资质已经审核/驳回过，请检查后重试"),

    //原错误码：K-010701
    K010150("会员权益不存在"),

    //原错误码：K-010702
    K010151("该权益已关联到客户等级，不可删除"),

    //原错误码：K-010703
    K010152("该权益名称已存在"),

    //原错误码：K-010704
    K010153("该权益绑定的优惠券数量超出限制"),

    //原错误码：K-010705
    K010154("该权益已关联到客户等级，不可禁用"),

    //原错误码：K-010706
    K010155("该权益已关联到付费会员等级，不可禁用"),

    //原错误码：K-010707
    K010156("该权益已关联到付费会员等级，不可删除"),

    //原错误码：K-091101
    K010157("成长值基础获取规则设置参数错误"),

    //原错误码：K-091201
    K010158("积分基础获取规则设置参数错误"),

    //原错误码：K-130001
    K010159("请选择优惠券！"),

    //原错误码：K-130001
    K010160("店铺最多可添加200款商品"),

    K010161("部分客户账号已被注销或禁用,请重新选择"),

    K010162("最多选择50个客户");



    private String msg;
    CustomerErrorCodeEnum(String msg){
        this.msg = msg;
    }


    @Override
    public String getCode() {
        return this.name();
    }

    public String getMsg(){
        return this.msg;
    }
}