package com.wanmi.sbc.setting.bean.enums;

import com.wanmi.sbc.common.enums.ErrorCode;

/**
 * @author zhanggaolei
 * @type SettingErrorCodeEnum.java
 * @desc
 * @date 2023/2/21 19:50
 */
public enum  SettingErrorCodeEnum implements ErrorCode {
    //原错误码：K-091001
    K070001("请先打开商品审核开关"),

    //原错误码：K-091301
    K070002("最多支持一次添加100个敏感词"),

    //原错误码：K-091302
    K070003("该敏感词超过30字符:{0}"),

    //原错误码：K-091401
    K070004("code不可重复"),

    //原错误码：K-091402
    K070005("{0}名称不可重复"),

    //原错误码：K-091403
    K070006("平台地区已被映射"),

    //原错误码：K-091404
    K070007("该地址已有关联的下级地址，不可删除"),

    //原错误码：K-091405
    K070008("该地址已被关联为平台映射地址，不可删除"),

    //原错误码：K-091406
    K070009("该地址已被关联为平台映射地址，不可删除"),

    //原错误码：K-091407
    K070010("渠道地址和平台地址无法匹配"),

    //原错误码：K-091501
    K070011("热门搜索词已存在"),

    //原错误码：K-091502
    K070012("搜索词已存在"),

    //原错误码：K-091503
    K070013("联想词已存在"),

    //原错误码：K-091504
    K070014("最多可添加3个长尾词"),

    //原错误码：K-091505
    K070015("长尾词不能重复"),

    //原错误码：K-091506
    K070016("联想词不存在"),

    //原错误码：K-091507
    K070017("退单原因不存在"),

    //原错误码：K-091601
    K070018("线下支付开关初始化失败"),

    //原错误码：K-091602
    K070019("支持的支付方式发生了变化，请重新选择！"),

    //原错误码：K-091701
    K070020("请先检查秒杀频道海报配置"),

    //原错误码：K-091801
    K070021("功能名称重复"),

    //原错误码：K-092001
    K070022("请保留一个启用的自提点"),

    //原错误码：K-092002
    K070023("自提点不存在"),

    //原错误码：K-092003
    K070024("默认自提点不允许禁用及删除"),

    //原错误码：K-092004
    K070025("退款原因最多支持50个"),

    //原错误码：K-092005
    K070026("该物流公司已存在，不可重复设置"),

    //原错误码：K-092006
    K070027("支付广告页存在同时段广告"),

    //原错误码：K-092007
    K070028("支付广告页不存在"),

    //原错误码：K-092008
    K070029("支付广告页不可删除"),

    //原错误码：K-092009
    K070030("支付广告页不可暂停"),

    //原错误码：K-092010
    K070031("支付广告页不可开启"),

    //原错误码：K-092011
    K070032("支付广告页不可关闭"),

    //原错误码：K-092012
    K070033("账号已撤销！"),

    //原错误码：K-092013
    K070034("账号已注销，无法撤销！"),

    //原错误码：K-092014
    K070035("存在未完成的积分订单！"),

    //原错误码：K-092015
    K070036("注销原因最多支持10个"),

    //原错误码：K-092017
    K070037("内容隐藏中,不可置顶"),

    //原错误码：K-092018
    K070038("最多置顶10条"),

    //原错误码：K-092019
    K070039("小程序页面最多配置200个"),

    //原错误码：K-061001
    K070040("对象存储未配置"),

    //原错误码：K-061002
    K070041("默认素材分类不存在错误"),

    //原错误码：K-061003
    K070042("该对象存储信息未配置，请编辑对象存储信息。"),

    //原错误码：invalid-parameter
    K070043("参数：无效，格式不对、非法值、越界等"),

    //原错误码：system-unknow-error
    K070044("系统未知异常"),

    //原错误码：img-cate-name-exist-error
    K070045("图片分类名称重复"),

    //原错误码：resource-cate-name-exist-error
    K070046("素材分类名称重复"),

    //原错误码：img-child-cate-max-count-error
    K070047("图片子分类数量超限20错误"),

    //原错误码：resource-child-cate-max-count-error
    K070048("素材子分类数量超限20错误"),

    //原错误码：parent-img-cate-not-exist-error
    K070049("图片父分类不存在错误"),

    //原错误码：parent-resource-cate-not-exist-error
    K070050("素材父分类不存在错误"),

    //原错误码：default-img-cate-not-exist-error
    K070051("默认图片分类不存在错误"),

    //原错误码：default-resource-cate-not-exist-error
    K070052("默认素材分类不存在错误"),

    //原错误码：img-server-not-configured-error
    K070053("图片服务器未配置"),

    //原错误码：resource-server-not-configured-error
    K070054("素材服务器未配置"),

    //原错误码：aliyun-img-upload-error
    K070055("阿里云上传图片失败，请联系管理员"),

    //原错误码：aliyun-resource-upload-error
    K070056("阿里云上传素材失败，请联系管理员"),

    //原错误码：aliyun-oss-service-error
    K070057("阿里云OSS连接不可用"),

    //原错误码：upload-file-error
    K070058("上传文件失败"),

    //原错误码：aliyun-delete-img-error
    K070059("阿里云删除图片失败，请联系管理员"),

    //原错误码：aliyun-delete-resource-error
    K070060("阿里云删除素材失败，请联系管理员"),

    //原错误码：img-not-exist-error
    K070061("图片不存在错误"),

    //原错误码：resource-not-exist-error
    K070062("素材不存在错误"),

    //原错误码：illegal-request-error
    K070063("非法请求错误"),

    //原错误码：express-company-max-count-error
    K070064("常用物流公司数量超限错误"),

    //原错误码：app-key-error
    K070065("appKey错误"),

    //原错误码：default-express-company-format-error
    K070066("默认物流公司文件数据格式化错误"),

    //原错误码：express-company-not-exist-error
    K070067("物流公司不存在"),

    //原错误码：online-server-not-exist-error
    K070068("在线客服不存在"),

    //原错误码：online-server-account-already-exist
    K070069("客服账号{0}已存在"),

    //原错误码：online-server-max-error
    K070070("最多添加10个客服账号"),

    //原错误码：app-key-multi-error
    K070071("存在多条数据"),

    //原错误码：point-used-switch-error
    K070072("每天只允许更改一次积分使用方式"),

    //原错误码：status_has_been_changed_error
    K070073("{0}，请刷新页面查看更新"),

    //原错误码：operation_not_in_sequence_error
    K070074("请按顺序操作{0}"),

    //原错误码：popular-search-terms-quantitatative-restriction
    K070075("最多可设置20个热门搜索词"),

    //原错误码：association-words-quantitative-restriction
    K070076("最多可设置20个联想词"),

    //原错误码：search-term-length
    K070077("长尾词最多1-5位字符"),

    //原错误码：preset-search-term-restrictions
    K070078("最多可设置1个预置搜索词"),

    //原错误码：popup-management-does-not-exist
    K070079("弹窗管理不存在"),

    //原错误码：popup-management-cannot-start
    K070080("弹窗管理无法启动"),

    //原错误码：popup-management-cannot-suspend
    K070081("弹窗管理无法暂停"),

    //原错误码：popup-management-stared-or-ended
    K070082("当前弹窗已开始或已结束，无法编辑"),

    //原错误码：popup-management-stared-or-ended-cannot-delete
    K070083("当前弹窗已开始或已结束，不能删除"),

    //原错误码：K090901
    K070084("最多可设置{0}个物流公司，请先删除使用不频繁的物流公司后再添加"),

    //原错误码：K-091527
    K070085("支付方式发生变化，请返回重新选择！"),

    //原错误码：K-092007
    K070086("存在未完成的订单/退单！"),

    //原错误码：K-092008
    K070087("余额未清空！"),

    //原错误码：K-092009
    K070088("授信账号有欠款！"),

    //原错误码：K-092012
    K070089("账号已撤销！"),

    //原错误码：K-092013
    K070090("账号已注销，无法撤销！"),

    //原错误码：K-092014
    K070091("存在未完成的积分订单！"),

    //原错误码：K-093001
    K070092("视频号内不支持此还款方式"),

    //原错误码：K-093002
    K070093("视频号内不支持0元订单"),

    //原错误码：K-093003
    K070094("视频号内不支持虚拟交易"),

    //原错误码：K-093004
    K070095("物流公司不可用，请重新选择"),

    //原错误码：K-093005
    K070096("此单不支持待客退单"),

    //原错误码：K-093006
    K070097("此单不支持此操作"),

    //原错误码：K-093007
    K070098("所选商品有进行中售后/售后超过5次"),

    //原错误码：K-093008
    K070099("请用账号关联的微信号支付"),

    //原错误码：K-093009
    K070100("种草内容开关未开启"),

    //原错误码：K-078642
    K070101("每天只允许一次开关拉卡拉支付方式"),

    //原错误码：K-078643
    K070102("当前有使用直连支付中的三方支付方式，支付的预售订单尚未支付尾款，不允许开启"),

    //原错误码：K-078644
    K070103("当前有使用拉卡拉聚合支付中的，微信或支付宝支付的预售订单尚未支付尾款，不允许关闭"),

    //原错误码：K-092016
    K070104("当前支付广告页已开始或已结束，无法编辑"),

    //原错误码：K-091002
    K070105("请先打开客户信息完善开关"),

    //原错误码：K-080001
    K070106("搜索词不存在"),

    K070107("文章信息不存在"),

    K070108("文章分类不存在"),

    K070109("当前文章正在展示中，不可删除"),

    K070110("文章分类名称已存在"),

    K070111("该分类已关联文章，无法删除"),

    K070112("文章分类最多可创建30个"),

    K070113("文章记录不存在"),

    K070114("该文章上次点击解决状态未超过24小时，请勿重复点击"),

    K070115("每天只允许修改一次库存预警开关"),

    K070116("拉卡拉支付和拉卡拉收银台支付仅允许同时开启一个"),

    K070117("拉卡拉收银台开启时，直连支付内仅允许开启余额和授信支付 ");

    private String msg;
    SettingErrorCodeEnum(String msg){
        this.msg = msg;
    }


    @Override
    public String getCode() {
        return this.name();
    }

    public String getMsg(){
        return this.msg;
    }
}