package com.wanmi.sbc.order.bean.enums;

import com.wanmi.sbc.common.enums.ErrorCode;

/**
 * @author zhanggaolei
 * @type OrderErrorCodeEnum.java
 * @desc
 * @date 2023/2/21 19:50
 */
public enum  OrderErrorCodeEnum implements ErrorCode {
    //原错误码：K-010309
    K050001("您的会员账号已被删除"),

    //原错误码：K-010310
    K050002("您的会员账号未审核"),

    //原错误码：K-010311
    K050003("您的会员账号已禁用"),

    //原错误码：K-050001
    K050004("{0}退货数量太多"),

    //原错误码：K-050002
    K050005("订单状态已改变，请关闭页面后重试!"),

    //原错误码：K-050003
    K050006("退单不存在"),

    //原错误码：K-050004
    K050007("退单状态不对"),

    //原错误码：K-050005
    K050008("退单自动收货失败"),

    //原错误码：K-050006
    K050009("退单已经计入账期，不能作废"),

    //原错误码：K-050100
    K050010("订单{0}不存在"),

    //原错误码：K-050101
    K050011("订单{0},需要支付{1},实际支付{2}"),

    //原错误码：K-050102
    K050012("订单状态已发生变更，请刷新页面"),

    //原错误码：K-050103
    K050013("订单尚未支付, 无法完成"),

    //原错误码：K-050104
    K050014("订单已经审核过, 不能修改"),

    //原错误码：K-050105
    K050015("订单尚未支付, 无法退款"),

    //原错误码：K-050106
    K050016("订单已发货, 无法退款"),

    //原错误码：K-050107
    K050017("订单尚未全部发货, 不能确认"),

    //原错误码：K-050108
    K050018("没有支付, 并且不是货到付款, 不能审核通过"),

    //原错误码：K-050109
    K050019("商品{0}, 购买了{1}, 当前发货{2}"),

    //原错误码：K-050110
    K050020("商品{0}, 最小起订量{1}, 当前购买量{2}"),

    //原错误码：K-050111
    K050021("商品{0}, 最大起订量{1}, 当前购买量{2}"),

    //原错误码：K-050112
    K050022("商品{0}, 没有符合的订货区间, 当前购买量{1}"),

    //原错误码：K-050113
    K050023("{0}给字段{1}设值报错"),

    //原错误码：K-050114
    K050024("订单{0}已申请售后，暂时不能发货"),

    //原错误码：K-050115
    K050025("该订单正在售后处理中"),

    //原错误码：K-050116
    K050026("很抱歉，您的订单中包含缺货商品！"),

    //原错误码：K-050117
    K050027("很抱歉，您的订单中包含不符合下单条件的商品！"),

    //原错误码：K-050118
    K050028("商品采购量不可大于库存量"),

    //原错误码：K-050119
    K050029("加购量不可大于剩余库存"),

    //原错误码：K-050120
    K050030("订单下有未完成的退单,不能再次创建"),

    //原错误码：K-050121
    K050031("购物车容量达到上限！"),

    //原错误码：K-050122
    K050032("该订单未审核，暂不支持开票"),

    //原错误码：K-050123
    K050033("该订单已打回，暂不支持开票"),

    //原错误码：K-050124
    K050034("该物流单号已存在，请核实"),

    //原错误码：K-050125
    K050035("订单状态异常,不能执行{0}操作"),

    //原错误码：K-050126
    K050036("退款金额不可大于可退金额"),

    //原错误码：K-050127
    K050037("该订单已支付，不支持回审"),

    //原错误码：K-050128
    K050038("该订单正在支付中，不支持回审"),

    //原错误码：K-050129
    K050039("订单自动收货失败"),

    //原错误码：K-050130
    K050040("订单设置参数错误"),

    //原错误码：K-050131
    K050041("订单已经计入账期，不能作废"),

    //原错误码：K-050132
    K050042("最多可退金额{0}"),

    //原错误码：K-050133
    K050043("订单审核开关已关闭，回审无效"),

    //原错误码：K-050134
    K050044("该订单未付款，暂不支持开票"),

    //原错误码：K-050135
    K050045("该订单已作废，暂不支持开票"),

    //原错误码：K-050136
    K050046("订单{0}已申请售后，暂时不能发货"),

    //原错误码：K-050137
    K050047("订单{0}已申请售后，暂时不能发货"),

    //原错误码：K-050139
    K050048("最多可退运费{0}"),

    //原错误码：K-050140
    K050049("很抱歉，您的订单中包含不符合下单条件的商品！"),

    //原错误码：K-050141
    K050050("待成团订单暂不支持退单"),

    //原错误码：K-050142
    K050051("发货失败，请前往物流设置完善回调地址"),

    //原错误码：K-050143
    K050052("很抱歉，您所选的收货区域部分商品库存不足！"),

    //原错误码：K-050144
    K050053("很抱歉，您的订单中包含当前地址不支持销售的商品!"),

    //原错误码：K-050145
    K050054("很抱歉，您的订单中包含不支持自提的商品!"),

    //原错误码：K-050146
    K050055("很抱歉，您的订单中包含不支持的自提店铺!"),

    //原错误码：K-050147
    K050056("很抱歉，您的订单中包含不支持自提点!"),

    //原错误码：k-050148
    K050057("无可退商品"),

    //原错误码：K-050149
    K050058("申请的商品未发货"),

    //原错误码：k-050150
    K050059("订单确认不能同时含有跨境商品和普通商品"),

    //原错误码：k-050151
    K050060("跨境订单必须有身份证信息"),

    //原错误码：k-050152
    K050061("跨境订单已完成拆单，暂不支持申请退款"),

    //原错误码：K-050173
    K050062("收货地址超出门店配送范围"),

    //原错误码：K-050201
    K050063("您成功下单了订单中的商品，如还需购买，请重新下单。"),

    //原错误码：K-050202
    K050064("不能取消已支付订单"),

    //原错误码：K-050203
    K050065("发货状态异常，无法取消订单"),

    //原错误码：K-050204
    K050066("订单用户与当前用户不一致"),

    //原错误码：K-050205
    K050067("很抱歉，您的订单中包含不存在的商品！"),

    //原错误码：K-050206
    K050068("订单状态异常，无法支付"),

    //原错误码：K-050207
    K050069("退货商品价格异常"),

    //原错误码：K-050208
    K050070("订单已不支持售后"),

    //原错误码：K-050209
    K050071("店铺{0}支持的开票类型已发生了变化，请重新选择"),

    //原错误码：K-050210
    K050072("店铺状态已发生了变化，请重新选择店铺商品"),

    //原错误码：K-050211
    K050073("该订单正在支付中，不支持修改"),

    //原错误码：K-050212
    K050074("该订单已支付，不支持修改"),

    //原错误码：K-050213
    K050075("你已经成功下单了该商品，如还需购买，请重新立即购买"),

    //原错误码：K-050214
    K050076("该订单处于授信还款中，不可申请退款"),

    //原错误码：K-050215
    K050077("不能取消待确认订单"),

    //原错误码：K-050216
    K050078("订单已没有可退商品"),

    //原错误码：K-050221
    K050079("获取满减级别错误"),

    //原错误码：K-050233
    K050080("订单已作废"),

    //原错误码：K-050238
    K050081("订单已没有可退商品"),

    //原错误码：K-050293
    K050082("订单不支持在途退货"),

    //原错误码：K-050311
    K050083("未找到任何有效的营销活动"),

    //原错误码：K-050312
    K050084("订单中存在不符合条件的营销活动"),

    //原错误码：K-050313
    K050085("当前收货地址不存在或已被删除，请重新选择"),

    //原错误码：K-050314
    K050086("请选择发货商品"),

    //原错误码：K-050315
    K050087("当前发货状态已发生变化，请刷新页面查看更新"),

    //原错误码：K-050316
    K050088("当前订单审核状态已发生变化，请刷新页面查看更新"),

    //原错误码：K-050317
    K050089("当前订单尚未通过审核，暂不支持发货"),

    //原错误码：K-050317
    K050090("您的积分不足，无法操作"),

    //原错误码：K-050318
    K050091("当前订单为先款后货，但尚未支付，暂不支持发货"),

    //原错误码：K-050319
    K050092("请填写默认收货地址"),

    //原错误码：K-050401
    K050093("商品未关联进行中的拼团活动"),

    //原错误码：K-050402
    K050094("已开团，不可再开团"),

    //原错误码：K-050403
    K050095("已参同一团活动，不可再参团"),

    //原错误码：K-050404
    K050096("已成团/团已作废，不可参团"),

    //原错误码：K-050405
    K050097("未达到拼团商品起售数"),

    //原错误码：K-050406
    K050098("已超过拼团商品限购数"),

    //原错误码：K-050407
    K050099("非0元订单无法使用默认支付"),

    //原错误码：K-050409
    K050100("拼团订单不存在"),

    //原错误码：K-050410
    K050101("当前订单不支持核销"),

    //原错误码：K-050411
    K050102("当前订单不支持核销"),

    //原错误码：K-050412
    K050103("当前订单已申请售后，暂不支持核销"),

    //原错误码：K-050413
    K050104("当前订单不支持核销"),

    //原错误码：K-050414
    K050105("找不到订单，请检查核销码是否正确"),

    //原错误码：K-050415
    K050106("当前商品未全部发货,暂不支持确认收货"),

    //原错误码：K-050416
    K050107("尚未成团，暂不支持自提核销"),

    //原错误码：K-050417
    K050108("订单开票Id不存在"),

    //原错误码：K-050418
    K050109("您选择的收货地址原有营销活动已失效，将导致部分商品价格发生变动，确认切换？"),

    //原错误码：K-050419
    K050110("订单不可使用积分"),

    //原错误码：K-050420
    K050111("很抱歉，当前营销已失效，请刷新后重新下单"),

    //原错误码：K-050421
    K050112("不同供应商之间的商品不可批量审核"),

    //原错误码：K-050422
    K050113("自营商品和代销商品不可批量审核"),

    //原错误码：K-050423
    K050114("非拼团商品，不允许购买"),

    //原错误码：K-050425
    K050115("部分商品不可加购"),

    //原错误码：K-050426
    K050116("加购失败"),

    //原错误码：K-050450
    K050117("该商品不支持加入购物车"),

    //原错误码：K-050452
    K050118("您的订单中包含已删除商品"),

    //原错误码：K-050453
    K050119("您的订单中包含已下架商品"),

    //原错误码：K-050454
    K050120("您的订单中包含禁售商品"),

    //原错误码：K-050455
    K050121("您的订单中包含审核未通过商品"),

    //原错误码：K-050456
    K050122("您的订单中包含缺货商品"),

    //原错误码：K-050457
    K050123("您的订单中包含预约活动未开始的商品，请刷新后重新下单"),

    //原错误码：K-050458
    K050124("您的订单中包含预约活动已结束的商品，请刷新后重新下单"),

    //原错误码：K-050459
    K050125("您的订单中包含预约活动已失效的商品，请刷新后重新下单"),

    //原错误码：K-050460
    K050126("您的订单中包含预约中的商品，请刷新后重新下单"),

    //原错误码：K-050461
    K050127("您的订单中包含凭借预约资格购买的商品，您还没有获取资格"),

    //原错误码：K-050462
    K050128("您的订单中包含预售活动已失效的商品，请刷新后重新下单"),

    //原错误码：K-050463
    K050129("大于预售库存"),

    //原错误码：K-050464
    K050130("抱歉！异常订单"),

    //原错误码：K-050465
    K050131("请填写默认收货地址"),

    //原错误码：K-050466
    K050132("您的订单中部分营销已失效，请刷新后重新下单"),

    //原错误码：K-050467
    K050133("抱歉，您的订单中的商品已经生效其他营销活动，请刷新后重新下单"),

    //原错误码：K-050570
    K050134("该商品最低需{0}期"),

    //原错误码：K-050571
    K050135("该商品送达时间发生变化，请重新选择"),

    //原错误码：K-050572
    K050136("周期购商品已失效，请稍后重试"),

    //原错误码：K-050573
    K050137("该商品暂不支持周期购活动"),

    //原错误码：K-050574
    K050138("最多支持{0}期"),

    //原错误码：K-050580
    K050139("平台未开启买家自主修改收货地址开关"),

    //原错误码：K-050581
    K050140("{0}不支持修改收货地址"),

    //原错误码：K-050582
    K050141("您的订单已经发货，如需修改请联系商家处理"),

    //原错误码：K-050583
    K050142("您之前已经修改过收货地址，不允许再次修改"),

    //原错误码：K-050584
    K050143("新地址会导致运费发生变化，如需修改请联系商家处理"),

    //原错误码：K-051129
    K050144("该订单已作废，暂不支持顺延或者取消顺延"),

    //原错误码：K-059999
    K050145("订单支付结果数据已存在"),

    //原错误码：K-068899
    K050146("供应商运费不可修改,最低配送费用为{0}"),

    //原错误码：K-069999
    K050147("订单退款结果数据已存在"),

    //原错误码：K-220001
    K050148("请完善收货地址"),

    //原错误码：K-220011
    K050149("非法越权操作"),

    //原错误码：K-600009
    K050150("很抱歉，预约活动已失效，请修改后重新提交！"),

    //原错误码：K-600010
    K050151("很抱歉，预售活动已失效，请修改后重新提交！"),

    //原错误码：K-600021
    K050152("很抱歉，预售活动商品数量已售尽"),

    //原错误码：K-020007
    K050153("该订单不存在"),

    //原错误码：K-020010
    K050154("下单失败"),

    //原错误码：K-050324
    K050155("虚拟商品不可手动发货"),

    //原错误码：K-050329
    K050156("请完善订单开票收货地址"),

    //原错误码：K-050657
    K050157("该周期购订单没有配送计划"),

    //原错误码：K-058657
    K050158("该商品已有生效中的周期购活动"),

    //原错误码：K-151129
    K050159("代客下单不支持周期购，请刷新后重新选择商品"),

    //原错误码：K-151229
    K050160("正在生效中的周期购商品不能删除"),

    //原错误码：K-600019
    K050161("很抱歉，组合购活动已失效，请修改后重新提交！"),

    //原错误码：K-050451
    K050162("同城配送订单不支持提前确认收货"),

    //原错误码：K-090903
    K050163("物流公司不存在"),

    //原错误码：K-050463
    K050164("大于预售库存"),

    //原错误码：K-050703
    K050165("城市不在配送范围内"),

    //原错误码：K-050701
    K050166("网络异常，无法调用接口"),

    //原错误码：K-050702
    K050167("调用异常:{0}"),

    //原错误码：K-230001
    K050168("达达已接单，无法取消呼叫"),

    //原错误码：K_090705
    K050169("开关不存在"),

    //原错误码：K-040040
    K050170("该自提点员工存在停用员工XXX，请重新选择！"),

    //原错误码：K-050468
    K050171("渠道商品价格存在变动！"),

    K050172("商品已删除！请刷新页面"),

    K050173("订单已不支持重发，请检查后重新选择"),

    K050174("平台未开启快速下单开关"),

    K050175("您的订单已发生变化，请刷新后重新下单"),

    K050176("最多可选{0}款商品"),

    K050177("提货卡不可用"),

    K050178("活动不在时间内"),

    K050179("商品不在活动范围内"),

    K050180("团长与活动不匹配"),

    K050181("团长信息校验未通过"),

    K050182("自提点校验未通过"),

    K050183("当前活动不支持跟团购买"),

    K050184("当前活动仅支持跟团购买"),

    K050185("此商品已参与预约或预售活动,不可修改"),

    K050186("请选择配送日期"),

    K050187("当前日期不可顺延或取消顺延"),

    K050188("平台退款失败"),

    K050189("发货信息不存在");


    private String msg;
    OrderErrorCodeEnum(String msg){
        this.msg = msg;
    }


    @Override
    public String getCode() {
        return this.name();
    }

    public String getMsg(){
        return this.msg;
    }
}